---
kind: method
id: M:Autodesk.Revit.DB.ExternalResourceReference.#ctor(Autodesk.Revit.DB.ExternalResourceReference)
source: html/23eafbee-60c6-6c26-e4e1-5ed224d3bd08.htm
---
# Autodesk.Revit.DB.ExternalResourceReference.#ctor Method

Creates a new ExternalResourceReference from the given ExternalResourceReference.

## Syntax (C#)
```csharp
public ExternalResourceReference(
	ExternalResourceReference other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.ExternalResourceReference`) - The ExternalResourceReference to copy.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null